Revit 2027 API
IFCParameterTemplate.ExportRevitElementParameters Property
 The option to export Revit element parameters to IFC. If true, then all Revit element parameters not excluded will be exported. If false, then no Revit element parameters will be exported.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool ExportRevitElementParameters { get; set; }
Public Property ExportRevitElementParameters As Boolean
	Get
	Set
public:
property bool ExportRevitElementParameters {
	bool get ();
	void set (bool value);
}
member ExportRevitElementParameters : bool with get, set
Property Value
Boolean
See Also
Reference
IFCParameterTemplate Class
Autodesk.Revit.DB Namespace